<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [1]:
import pandas as pd
import psycopg2

In [2]:
connection = {k:v.strip() for k, v in (l.split('=') for l in open('config.txt'))}

In [2]:
# connection = psycopg2.connect(
#     dbname='***',
#     user='***',
#     host='***',
#     password='***',
#     port=***
# )

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [5]:
# текст запроса
query_3_1 = f'''select
                    count(id)
                from public.vacancies
'''
pd.read_sql_query(query_3_1, connection)

C:\Users\Lukyanenko\AppData\Local\Temp\ipykernel_15168\3229066468.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_3_1, connection)

   count
0  49197

In [6]:
# результат запроса:
# 49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [7]:
# текст запроса
query_3_2 = f'''select
                    count(id)
                from public.employers
'''
pd.read_sql_query(query_3_2, connection)

C:\Users\Lukyanenko\AppData\Local\Temp\ipykernel_15168\2799080448.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_3_2, connection)

   count
0  23501

In [8]:
# результат запроса:
# 23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [9]:
# текст запроса
query_3_3 = f'''select 
                    count(id)
                from public.areas
'''
pd.read_sql_query(query_3_3, connection)

C:\Users\Lukyanenko\AppData\Local\Temp\ipykernel_15168\595348855.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_3_3, connection)

   count
0   1362

In [10]:
# результат запроса:
# 1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [11]:
# текст запроса
query_3_4 = f'''select 
                    count(id)
                from public.industries
'''
pd.read_sql_query(query_3_4, connection)

C:\Users\Lukyanenko\AppData\Local\Temp\ipykernel_15168\3060361203.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_3_4, connection)

   count
0    294

In [12]:
# результат запроса:
# 294

***

In [13]:
# выводы по предварительному анализу данных:

#Рассматриваемые данные охватывают почти 50 тысяч вакансий у 23 с половиной тысяч работодателей в более тысячи трёхсот регионах и почти 300 индустриях.

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [14]:
# текст запроса
query_4_1 = f'''select 
                    a.name,
                    count(v.id)
                from public.areas a
                join public.vacancies v on a.id = v.area_id
                group by 1
                order by 2 desc
                --limit 7
'''
pd.read_sql_query(query_4_1, connection)

C:\Users\Lukyanenko\AppData\Local\Temp\ipykernel_15168\383664830.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_4_1, connection)

                name  count
0             Москва   5333
1    Санкт-Петербург   2851
2              Минск   2112
3        Новосибирск   2006
4             Алматы   1892
..               ...    ...
764       Тарко-Сале      1
765    Новоаннинский      1
766            Бирск      1
767           Сасово      1
768             Анна      1

[769 rows x 2 columns]

In [15]:
# результат запроса:
#
# name	count
# 0	Москва	5333
# 1	Санкт-Петербург	2851
# 2	Минск	2112
# 3	Новосибирск	2006
# 4	Алматы	1892
# ...	...	...
# 764	Тарко-Сале	1
# 765	Новоаннинский	1
# 766	Бирск	1
# 767	Сасово	1
# 768	Анна	1

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [16]:
# текст запроса
query_4_2 = f'''select 
                    count(id)
                from public.vacancies
                where salary_from is not null or salary_to is not null
'''
pd.read_sql_query(query_4_2, connection)

C:\Users\Lukyanenko\AppData\Local\Temp\ipykernel_15168\2419276503.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_4_2, connection)

   count
0  24073

In [17]:
# результат запроса
# 24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [18]:
# текст запроса
query_4_3 = f'''select 
                    avg(salary_from) avg_salary_from,
                    avg(salary_to) avg_salary_to
                from public.vacancies           
'''
pd.read_sql_query(query_4_3, connection)

C:\Users\Lukyanenko\AppData\Local\Temp\ipykernel_15168\163311322.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_4_3, connection)

   avg_salary_from  avg_salary_to
0     71064.657901  110536.741923

In [19]:
# результат запроса
# avg_salary_from	avg_salary_to
# 	71064.657901	110536.741923

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [20]:
# текст запроса
query_4_4 = f'''select
                       schedule,
                       employment,
                       count(*)
                from public.vacancies
                group by 1,2
                order by 3 desc
                --limit 2     
'''
pd.read_sql_query(query_4_4, connection)

C:\Users\Lukyanenko\AppData\Local\Temp\ipykernel_15168\969823960.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_4_4, connection)

            schedule           employment  count
0        Полный день     Полная занятость  35367
1   Удаленная работа     Полная занятость   7802
2      Гибкий график     Полная занятость   1593
3   Удаленная работа  Частичная занятость   1312
4     Сменный график     Полная занятость    940
5        Полный день           Стажировка    569
6     Вахтовый метод     Полная занятость    367
7        Полный день  Частичная занятость    347
8      Гибкий график  Частичная занятость    312
9        Полный день     Проектная работа    141
10  Удаленная работа     Проектная работа    133
11     Гибкий график           Стажировка    116
12    Сменный график  Частичная занятость    101
13  Удаленная работа           Стажировка     64
14     Гибкий график     Проектная работа     18
15    Сменный график           Стажировка     12
16    Вахтовый метод     Проектная работа      2
17    Сменный график     Проектная работа      1

In [21]:
# результат запроса
# 	schedule	employment	count
# 0	Полный день	Полная занятость	35367
# 1	Удаленная работа	Полная занятость	7802

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [22]:
# текст запроса
query_4_5 = f'''select
                    experience,
                    count(*)   
                from public.vacancies
                group by 1
                order by 2     
'''
pd.read_sql_query(query_4_5, connection)

C:\Users\Lukyanenko\AppData\Local\Temp\ipykernel_15168\1397165251.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_4_5, connection)

           experience  count
0         Более 6 лет   1337
1           Нет опыта   7197
2       От 3 до 6 лет  14511
3  От 1 года до 3 лет  26152

In [23]:
# результат запроса

# experience	count
# 0	Более 6 лет	1337
# 1	Нет опыта	7197
# 2	От 3 до 6 лет	14511
# 3	От 1 года до 3 лет	26152

***

выводы по детальному анализу вакансий

Вакансии преимущественно сосредоточены в городах федерального значения, крупных региональных центрах. 
Кроме того, рассматриваемая база не ограничевается РФ, но включает в себя и большое количество вакансий в сранах ближнего зарубежья.

Половина вакансий не содержит каких-либо границ в з/п, что может свидетельствовать о "рынке работника" и неоднородности спроса и предложения в пользу соискателей, который существовал на момент выгрузки данных.
Средние значения максимумов и минимумов з/п в вакансиях позволяют говорить об оценке компаниями средней стоимости на рынке труда сотрудника в 70-110 тысяч рублей. 

Подавляющее число вакансий предполагает условия полной занятости и штатной работы.
Большая часть вакансий требует опыт, причем для соискателей получивших первый год опыта работы, число вакансий расширяется почти 3,5 раза! 
В то время как опыт работы выше 6 лет в выборке вакансий не велик. Вероятно, это можно объяснить иными способами хедхантинга высококлассных специалистов.

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [25]:
# текст запроса
query_5_1 = f'''(select
                    e.name,
                    count(v.id)
                from public.vacancies v
                join public.employers e on v.employer_id = e.id
                group by 1
                order by 2 desc
                limit 1)
                union
                (select
                    e.name,
                    count(v.id)   
                from public.vacancies v
                join public.employers e on v.employer_id = e.id
                group by 1
                order by 2 desc
                offset 4
                limit 1)
                order by 2 desc
                
'''
pd.read_sql_query(query_5_1, connection)

C:\Users\Lukyanenko\AppData\Local\Temp\ipykernel_15168\1947369046.py:23: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_5_1, connection)

            name  count
0         Яндекс   1933
1  Газпром нефть    331

In [26]:
# результат запроса

# name	count
# 0	Яндекс	1933
# 1	Газпром нефть	331

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [61]:
# текст запроса
query_5_2 = f'''select
                    a.name area,
                    count(e.id) employers,
                    count(v.id) vacancies
                from public.areas a
                left join public.employers e on e.area = a.id
                left join public.vacancies v on a.id = v.area_id
                group by 1
                --having count(v.id) is null
                order by 3, 2 desc
'''
pd.read_sql_query(query_5_2, connection)

C:\Users\Lukyanenko\AppData\Local\Temp\ipykernel_15168\3514056101.py:13: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_5_2, connection)

                    area  employers  vacancies
0                 Россия        410          0
1              Казахстан        207          0
2     Московская область         75          0
3     Краснодарский край         19          0
4     Ростовская область         18          0
...                  ...        ...        ...
1357         Новосибирск    1149438    1149438
1358              Алматы    1364132    1364132
1359               Минск    2354880    2354880
1360     Санкт-Петербург    6320667    6320667
1361              Москва   31272712   31272712

[1362 rows x 3 columns]

In [28]:
# результат запроса

# area	employers	vacancies
# 0	Россия	410	0
# 1	Казахстан	207	0
# 2	Московская область	75	0
# 3	Краснодарский край	19	0
# 4	Ростовская область	18	0
# ...	...	...	...
# 1357	Новосибирск	1149438	1149438
# 1358	Алматы	1364132	1364132
# 1359	Минск	2354880	2354880
# 1360	Санкт-Петербург	6320667	6320667
# 1361	Москва	31272712	31272712

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [65]:
# текст запроса
query_5_3 = f'''select
                    e.name employer,
                    count(distinct v.area_id) areas
                from public.employers e
                join public.vacancies v on e.id = v.employer_id
                group by 1
                order by 2 desc
'''
pd.read_sql_query(query_5_3, connection)

C:\Users\Lukyanenko\AppData\Local\Temp\ipykernel_15168\642388552.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_5_3, connection)

                     employer  areas
0                      Яндекс    181
1                  Ростелеком    152
2                  Спецремонт    116
3      Поляков Денис Иванович     88
4                   ООО ЕФИН      71
...                       ...    ...
14761                  UniSol      1
14762            UNISTORY LLC      1
14763                   UNIT6      1
14764     United Distribution      1
14765              UNITEL LLC      1

[14766 rows x 2 columns]

In [30]:
# результат запроса

# employer	areas
# 0	Яндекс	181
# 1	Ростелеком	152
# 2	Спецремонт	116
# 3	Поляков Денис Иванович	88
# 4	ООО ЕФИН	71
# ...	...	...
# 14761	UniSol	1
# 14762	UNISTORY LLC	1
# 14763	UNIT6	1
# 14764	United Distribution	1
# 14765	UNITEL LLC	1

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [114]:
# текст запроса
query_5_4 = f'''select
                    ei.employer_id employers_witout_undustries
                from public.employers e
                left join public.employers_industries ei on e.id = ei.employer_id
                where industry_id is null
'''
pd.read_sql_query(query_5_4, connection)

C:\Users\Lukyanenko\AppData\Local\Temp\ipykernel_3936\1704157588.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_5_4, connection)

     employers_witout_undustries
0                           None
1                           None
2                           None
3                           None
4                           None
...                          ...
8414                        None
8415                        None
8416                        None
8417                        None
8418                        None

[8419 rows x 1 columns]

In [32]:
# результат запроса
# 8419 rows

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [115]:
# текст запроса
query_5_5 = f'''select
                    e.name,
                    count(ei.employer_id)
                from public.employers e
                join public.employers_industries ei on e.id = ei.employer_id
                group by 1
                having count(ei.employer_id) = 4
                order by 1
                offset 2 limit 1
'''
pd.read_sql_query(query_5_5, connection)

C:\Users\Lukyanenko\AppData\Local\Temp\ipykernel_3936\2814014771.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_5_5, connection)

   name  count
0  2ГИС      4

In [34]:
# результат запроса

#0	2ГИС

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [93]:
# текст запроса
query_5_6 = f'''select
                    count(ei.employer_id)
                from employers_industries ei
                join industries i on i.id = ei.industry_id
                where i.name = 'Разработка программного обеспечения'
'''
pd.read_sql_query(query_5_6, connection)

C:\Users\Lukyanenko\AppData\Local\Temp\ipykernel_15168\3415459862.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_5_6, connection)

   count
0   3553

In [36]:
# результат запроса
# 3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [111]:
# код для получения списка городов-милионников
from urllib.parse import quote_plus

url = quote_plus('https://ru.wikipedia.org/wiki/Города-миллионеры_России#Список_городов-миллионеров', safe=':/')

cities = pd.read_html(url)[1]

In [112]:
cities

,№,Город,"Население, тыс. чел. (на 1 января 2023 года)","Население, тыс. чел. (итоги переписи 2021 года)[5]",Прирост относительно переписи-2010,"Население, тыс. чел. (итоги переписи 2010 года)[6]"
0,1,Москва,13 098,13 010,"13,1%",11 504
1,2,Санкт-Петербург,5 598,5 602,"14,8%",4 880
2,3,Новосибирск,1 635,1 634,"10,9%",1 474
3,4,Екатеринбург,1 539,1 544,"14,4%",1 350
4,5,Казань,1 315,1309,"14,4%",1144
5,6,Нижний Новгород,NaN,1 226,NaN,1 251
6,7,Красноярск,1 197,1 188,"21,6%",977
7,8,Челябинск,1 183,1 190,"5,3%",1 130
8,9,Самара,NaN,1 173,"0,3%",1 169
9,10,Уфа,NaN,1 145,"7,8%",1 062
10,11,Ростов-на-Дону,NaN,1 142,"4,9%",1 089
11,12,Омск,NaN,1 126,NaN,1166
12,13,Краснодар,1 122,1 099,"43,8%",764
13,14,Воронеж[a],NaN,1 058,"18,9%",890
14,15,Пермь,1 027,1 034,"4,3%",991
15,16,Волгоград,1 026,1 028,"0,7%",1 021

In [95]:
cities = cities.replace({'Воронеж[a]': 'Воронеж'})

In [99]:
list_cities = cities['Город'].values.tolist()

In [106]:
list_cities = tuple(list_cities)

In [110]:
# текст запроса
query = f'''(SELECT 
                a.name "city",
                COUNT(v.id) "vacancies"
            FROM public.vacancies v
                JOIN public.employers e ON e.id = v.employer_id
                JOIN public.areas a ON a.id = v.area_id
            WHERE e.name = 'Яндекс' and a.name in {list_cities}
            GROUP BY a.id
            ORDER BY 2 ASC)
            
            UNION ALL 

            (SELECT 
                'TOTAL',
                COUNT (*) "Общ кол-во вакансий в городах-миллионниках"
            FROM public.vacancies v
                JOIN public.employers e ON e.id = v.employer_id
                JOIN public.areas a ON a.id = v.area_id
            WHERE e.name = 'Яндекс' and a.name in {list_cities}) 
            order by 2
           
        ''' 
df = pd.read_sql_query(query, connection)
df

C:\Users\Lukyanenko\AppData\Local\Temp\ipykernel_3936\2030691681.py:24: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

               city  vacancies
0              Омск         21
1         Челябинск         22
2        Красноярск         23
3         Волгоград         24
4             Пермь         25
5    Ростов-на-Дону         25
6            Казань         25
7            Самара         26
8               Уфа         26
9         Краснодар         30
10          Воронеж         32
11      Новосибирск         35
12  Нижний Новгород         36
13     Екатеринбург         39
14  Санкт-Петербург         42
15           Москва         54
16            TOTAL        485

In [39]:
# результат запроса
# city	vacancies
# 0	Омск	21
# 1	Челябинск	22
# 2	Красноярск	23
# 3	Волгоград	24
# 4	Пермь	25
# 5	Ростов-на-Дону	25
# 6	Казань	25
# 7	Самара	26
# 8	Уфа	26
# 9	Краснодар	30
# 10	Воронеж	32
# 11	Новосибирск	35
# 12	Нижний Новгород	36
# 13	Екатеринбург	39
# 14	Санкт-Петербург	42
# 15	Москва	54
# 16	TOTAL	485

***

In [40]:
# выводы по анализу работодателей

# Работодатели сосредоточены преимущественно в крупных городах. 

# Для многих компаний характерна публикация вакансий в том числе в регионах, где компания не представлена или в нарочито "широких" регионах, 
# например "Россия" целиком, что значительно затрудняет анализ и более детальную привязку к конкретным локациям.

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [35]:
# текст запроса
query_6_1 = f'''select
                    count(name)
                from public.vacancies
                where 
                    lower(name) like '%data%' or
                    lower(name) like '%данн%'
'''
pd.read_sql_query(query_6_1, connection)

C:\Users\Lukyanenko\AppData\Local\Temp\ipykernel_14784\4228586655.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_6_1, connection)

   count
0   1771

In [42]:
# результат запроса
# 1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [36]:
# текст запроса
query_6_2 = f'''select
                    count(name)
                from public.vacancies
                where 
                    (name ilike '%data%scientist%' or
                    name ilike '%data%science%' or
                    name ilike '%исследователь%данных%' or
                    name like '%ML%' or
                    name ilike '%machine%lerning%' or
                    name ilike '%машинн%обучен%') 
                    and
                    (name ilike '%junior%' or
                    experience ilike '%Нет%опыта%' or
                    employment ilike '%Стажировка%')
                    and
                    name not ilike '%html%'          
                    
'''
pd.read_sql_query(query_6_2, connection)

C:\Users\Lukyanenko\AppData\Local\Temp\ipykernel_14784\2481643866.py:20: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_6_2, connection)

   count
0     51

In [44]:
# результат запроса:
#51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [43]:
query_6_3 = f'''select
                    count(name)
                from public.vacancies
                where
                    (
                    name ILIKE '%data scientist%' or 
                    name ILIKE '%data science%' or 
                    name ILIKE '%исследователь данных%' or 
                    name LIKE '%ML%' or 
                    name ILIKE '%machine learning%' or 
                    name ILIKE '%машинн%обучен%'
                    ) 
                    and 
                    name NOT ILIKE '%HTML%'
                    and
                    (key_skills ilike '%sql%' or 
                    key_skills ilike '%postgres%')        
                    
'''
pd.read_sql_query(query_6_3, connection)

C:\Users\Lukyanenko\AppData\Local\Temp\ipykernel_3936\1468830660.py:20: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_6_3, connection)

   count
0    201

In [46]:
# результат запроса
# 201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [44]:
query_6_4 = f'''select
                    count(name)
                from public.vacancies
                where
                    (
                    name ILIKE '%data scientist%' or 
                    name ILIKE '%data science%' or 
                    name ILIKE '%исследователь данных%' or 
                    name LIKE '%ML%' or 
                    name ILIKE '%machine learning%' or 
                    name ILIKE '%машинн%обучен%'
                    ) 
                    and 
                    name NOT ILIKE '%HTML%'
                    and 
                    key_skills ilike '%python%'      
                    
'''
pd.read_sql_query(query_6_4, connection)

C:\Users\Lukyanenko\AppData\Local\Temp\ipykernel_3936\57926190.py:19: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_6_4, connection)

   count
0    351

In [48]:
# результат запроса
# 351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [39]:
query_6_5 = f''' 
            select
                round(avg((length(key_skills) +1) - length(replace(key_skills, CHR(9), '' )))::numeric, 2)
            from public.vacancies 
            where 
                (
                name ILIKE '%data scientist%' or 
                name ILIKE '%data science%' or 
                name ILIKE '%исследователь данных%' or 
                name LIKE '%ML%' or 
                name ILIKE '%machine learning%' or 
                name ILIKE '%машинн%обучен%'
                ) 
                and 
                name NOT ILIKE '%HTML%'
                and 
                key_skills is not null 
                    
'''
pd.read_sql_query(query_6_5, connection)

C:\Users\Lukyanenko\AppData\Local\Temp\ipykernel_3936\2457337925.py:20: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_6_5, connection)

   round
0   6.41

In [37]:
# результат запроса
# 6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [59]:
query_6_6 = f'''
            select 
                experience,
                round(avg(COALESCE(((salary_from + salary_to)/2), salary_from, salary_to, 0))) salary
            from public.vacancies
            where 
                (
                name ILIKE '%data scientist%' or 
                name ILIKE '%data science%' or 
                name ILIKE '%исследователь данных%' or 
                name LIKE '%ML%' or 
                name ILIKE '%machine learning%' or 
                name ILIKE '%машинн%обучен%'
                ) 
                and 
                name NOT ILIKE '%HTML%'
                and
                (salary_from is not null or
                salary_to is not null)
            group by 1
            
                
'''
df = pd.read_sql_query(query_6_6, connection)
df

C:\Users\Lukyanenko\AppData\Local\Temp\ipykernel_3936\3336471139.py:24: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_6, connection)

           experience    salary
0           Нет опыта   74643.0
1  От 1 года до 3 лет  139675.0
2       От 3 до 6 лет  243115.0

In [52]:
# результат запроса
# 243115

***

In [53]:
# выводы по предметному анализу

#По грубой оценке 1771 вакансий относятся к обработке данных. Из них 51 вакансия подходят для начинающего ds. 
#Навыки работы с python на 1,7 раза чаще указываются в качестве необходимых требований к соискателю, чем знания sql, 351 к 201 соответсвенно. 
#Впрочем, список необходимых навыков для соискателей значительно шире и в среднем достигает 6 на вакансию.
#Динамика роста средней з/п от опыта значительно растёт.

# Общий вывод по проекту

In [54]:
# подведем итог исследования, обобщите выводы
# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования

Проведя ряд sql-запросов и получив отдельные данные по выборке, наблюдается явная тенденция к концентрации вакансий 
и компаний в больших городах, а так же значительное расхождение средних показателей з/п от аналогичных федеративных 
показателей, рассчитанных "росстатом" или другими источниками по общему рынку труда.

Стоит отметить малую долю вакансий, принадлежащих к ds и их в среднем более высокую вилку з/п,
несмотря на эквивалентные средние требования к количеству навыков. Вероятно, стоимость отдельного уникального 
навыка неоднородно влияет на итоговую оценку кандадата на рынке труда. 

В качестве направления развития исследования первым делом представляется расширение данных во времени, 
что позволило бы оценить степень влияния пандемии и войны на рынок труда. Вероятно, с динамиками не в лучшую сторону.
Альтернативным исследованием с увеличением выборки может стать рассмотрение и it-рынка труда и других рынков.

In [21]:
#запрос на вытаскивание таблицы средних зарплат по всей базе с учетом опыта и подсчетом количества локаций, где в сумме они представлены.

#Это позволило говорить в выводе как об общей средней, так и о распределении публикации вакансий по количеству областей.

query_summary_1 = f'''select 
                        count(a.name),
                        experience,
                        round(avg(COALESCE(((salary_from + salary_to)/2), salary_from, salary_to, 0))) salary
                    from public.vacancies v
                    join public.areas a on v.area_id = a.id
                    group by 2
                    order by 3 desc
                
'''
sallary_describe = pd.read_sql_query(query_summary_1, connection)
sallary_describe

C:\Users\Lukyanenko\AppData\Local\Temp\ipykernel_2532\3559730643.py:15: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  sallary_describe = pd.read_sql_query(query_summary_1, connection)

   count          experience   salary
0   1337         Более 6 лет  68393.0
1  14511       От 3 до 6 лет  51858.0
2  26152  От 1 года до 3 лет  37518.0
3   7197           Нет опыта  28427.0

In [23]:
#Простой вывод компании и всех ей принадлежащих вакансий
query_summary_2 = f'''select
                    e.name,
                    count(v.id)
                from public.vacancies v
                join public.employers e on v.employer_id = e.id
                group by 1
                order by 2 desc
                
'''
vacancies_per_company = pd.read_sql_query(query_summary_2, connection)
#vacancies_per_company.head(50)

C:\Users\Lukyanenko\AppData\Local\Temp\ipykernel_2532\87515587.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  vacancies_per_company = pd.read_sql_query(query_summary_2, connection)

In [18]:
#Среднее требуемое количество навыков по всем вакансиям. 
# 
# Что любопытно, результат практически идентичен аналогичному с фильтрами для ds специалистов.

summary_3 = f''' 
            select
                round(avg((length(key_skills) +1) - length(replace(key_skills, CHR(9), '' )))::numeric, 2)
            from public.vacancies 
            where 
                key_skills is not null 
                    
'''
pd.read_sql_query(summary_3, connection)

C:\Users\Lukyanenko\AppData\Local\Temp\ipykernel_2532\1984899479.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(summary_3, connection)

   round
0   6.37